ExchangePlans/ОбменДанными2K_CRS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<ExchangePlan>
		<Properties>
			<Name>ОбменДанными2K_CRS</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОбъектовВПакете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиСвязейМеждуБазамиРС</Name>
					<Comment>Настройки которые определяют роли информационных баз в структуре узлов обмена, и в этой зависимости будут определятся к миграции необходимые данные.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОбъектаНастройки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗначимостиОбъекта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанныхОбъекта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыБазИсточниковПриОбменеЦРС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

Catalogs/ИдентификаторыОбъектовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыОбъектовМетаданных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокКоллекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйСиноним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПустойСсылки</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъектаМетаданных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ExchangePlans/ОбменДанными2K_CRS/Forms/ФормаОбъектаАрхив/Ext/Form/Module.bsl
Функция СоздатьГруппуКолонок(Имя, Тип, Родитель = Неопределено)

	ГруппаКолонок = Элементы.Добавить(Имя, Тип, Родитель); 
	
	Возврат ГруппаКолонок
	
КонецФункции // ()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УзелОбмена = ПланыОбмена.ОбменДанными2K_CRS.ЭтотУзел();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбменДанными2K_CRS.Ссылка) КАК Узлов
		|ИЗ
		|	ПланОбмена.ОбменДанными2K_CRS КАК ОбменДанными2K_CRS";

	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
	Выборка.Следующий();
	КоличествоУзловОбмена = Выборка.Узлов;

	Если КоличествоУзловОбмена = 1 Тогда
		РолевоеЗначениеЭтогоУзла = 1
	ИначеЕсли Не ПроцедурыОбменаДаннымиFrontOffice_Restoran.ЭтоЦентральнаяБаза(УзелОбмена) Тогда
		РолевоеЗначениеЭтогоУзла = 2
	Иначе
		РолевоеЗначениеЭтогоУзла = 3
	КонецЕсли;
	
	//РолевоеЗначениеЭтогоУзла = 3;
	
	СписокСоставаПоПолномуИмени = ОбменДаннымиПовтИсп.ПолучитьСписокОбъектовСоставаПланаОбмена("ОбменДанными2K_CRS", Истина);
	 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСоставаПоПолномуИмени", СписокСоставаПоПолномуИмени);
	Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменДанными.ИдентификаторОбъектаНастройки КАК ИдентификаторОбъектаНастройки,
		|	ОбменДанными.Ссылка КАК УзелОбмена,
		|	ОбменДанными.ИсточникДанных,
		|	ОбменДанными.ВидЗначимостиОбъекта
		|ПОМЕСТИТЬ ВТ_УзлыОбмена
		|ИЗ
		|	ПланОбмена.ОбменДанными2K_CRS.НастройкиСвязейМеждуБазамиРС КАК ОбменДанными
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИдентификаторыОбъектовМетаданных.Ссылка,
		|	ИдентификаторыОбъектовМетаданных.Родитель
		|ПОМЕСТИТЬ ИдентификаторыМД
		|ИЗ
		|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|ГДЕ
		|	ИдентификаторыОбъектовМетаданных.ПолноеИмя В(&СписокСоставаПоПолномуИмени)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИдентификаторыМД.Ссылка КАК Ссылка,
		|	ВТ_УзлыОбмена.ИдентификаторОбъектаНастройки,
		|	ИдентификаторыМД.Родитель КАК Родитель,
		|	ВТ_УзлыОбмена.УзелОбмена КАК УзелОбмена,
		|	0 КАК ИсточникДанных,
		|	0 КАК ВидЗначимостиОбъекта,
		|	ВТ_УзлыОбмена.УзелОбмена.Код КАК УзелОбменаКод
		|ИЗ
		|	ИдентификаторыМД КАК ИдентификаторыМД
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УзлыОбмена КАК ВТ_УзлыОбмена
		|		ПО ИдентификаторыМД.Ссылка = ВТ_УзлыОбмена.ИдентификаторОбъектаНастройки
		|ГДЕ
		|	ВТ_УзлыОбмена.ИдентификаторОбъектаНастройки ЕСТЬ NULL 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_УзлыОбмена.ИдентификаторОбъектаНастройки,
		|	NULL,
		|	ВТ_УзлыОбмена.ИдентификаторОбъектаНастройки.Родитель,
		|	ВТ_УзлыОбмена.УзелОбмена,
		|	ВТ_УзлыОбмена.ИсточникДанных,
		|	ВТ_УзлыОбмена.ВидЗначимостиОбъекта,
		|	ВТ_УзлыОбмена.УзелОбмена.Код
		|ИЗ
		|	ВТ_УзлыОбмена КАК ВТ_УзлыОбмена
		|
		|УПОРЯДОЧИТЬ ПО
		|	УзелОбменаКод,
		|	Родитель,
		|	Ссылка
		|ИТОГИ ПО
		|	УзелОбмена,
		|	Родитель";

		Результат = Запрос.Выполнить();
		
		//СтруктураДереваНастроек = Новый Структура;
		
		ВыборкаУзелОбмена = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ЗначениеДеревоНастроекОбъектов = ДанныеФормыВЗначение(ДеревоНастроекОбъектов, Тип("ДеревоЗначений"));
		ЧистКопия = ЗначениеДеревоНастроекОбъектов.Скопировать();
		ЧистКопия.Строки.Очистить();
		
		СоотвСтрокРодителей = Новый Соответствие;
		СоотвСтрок = Новый Соответствие;
		
		РестораныВОтдельныхТаблицах = Ложь;
		
		Если Не РестораныВОтдельныхТаблицах Тогда
			
			Пока ВыборкаУзелОбмена.Следующий() Цикл
				
				Если ПроцедурыОбменаДаннымиFrontOffice_Restoran.ЭтоЦентральнаяБаза(ВыборкаУзелОбмена.УзелОбмена) Тогда
					Продолжить;
				КонецЕсли;
				
				мНовыхРеквизитов = Новый Массив;
				ПриставкаУзла = "_Ресторан"+ВыборкаУзелОбмена.УзелОбмена.Код;
				НоваяКолонкаУзел = Новый РеквизитФормы("Узел"+ПриставкаУзла, Новый ОписаниеТипов("ПланОбменаСсылка.ОбменДанными2K_CRS"), "ДеревоНастроекОбъектов");
				НоваяКолонкаАВТ = Новый РеквизитФормы("ИсточникЗнач1"+ПриставкаУзла, Новый ОписаниеТипов("Булево"),"ДеревоНастроекОбъектов", "Авт");
				НоваяКолонкаЦБ = Новый РеквизитФормы("ИсточникЗнач3"+ПриставкаУзла, Новый ОписаниеТипов("Булево"),"ДеревоНастроекОбъектов", "ЦБ");
				НоваяКолонкаБух = Новый РеквизитФормы("ИсточникЗнач2"+ПриставкаУзла, Новый ОписаниеТипов("Булево"),"ДеревоНастроекОбъектов", "Бух");
				мНовыхРеквизитов.Добавить(НоваяКолонкаУзел);
				мНовыхРеквизитов.Добавить(НоваяКолонкаАВТ);
				мНовыхРеквизитов.Добавить(НоваяКолонкаЦБ);
				мНовыхРеквизитов.Добавить(НоваяКолонкаБух);
				ЭтаФорма.ИзменитьРеквизиты(мНовыхРеквизитов);
				//СоздатьГруппуКолонок("ДеревоЗначенийЭтоЦБГруппа"+ПриставкаУзла, Тип("ПолеФормы"), Элементы.ДеревоЗначенийЭтоЦБ);
				ГруппаКолонок                = Элементы.Добавить("ДеревоЗначенийЭтоЦБГруппа"+ПриставкаУзла, Тип("ГруппаФормы") , Элементы.ДеревоЗначенийЭтоЦБ);
				ГруппаКолонок.Вид            = ВидГруппыФормы.ГруппаКолонок;
				ГруппаКолонок.ОтображатьВШапке = Истина;
				ГруппаКолонок.ОтображатьЗаголовок = Истина;
				ГруппаКолонок.Группировка = ГруппировкаКолонок.Горизонтальная;
				ГруппаКолонок.Заголовок = "Ресторан "+ВыборкаУзелОбмена.УзелОбмена + " (" + (ВыборкаУзелОбмена.УзелОбмена.Код) + ")";
				ГруппаКолонок.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
				
				НовыйЭлемент = Элементы.Добавить("Узел"+ПриставкаУзла,Тип("ПолеФормы"), ГруппаКолонок); 
				НовыйЭлемент.Видимость = Ложь;
				НовыйЭлемент.ПутьКДанным = "ДеревоНастроекОбъектов.Узел"; 
				
				НовыйЭлемент = Элементы.Добавить("ИсточникЗнач1"+ПриставкаУзла, Тип("ПолеФормы"), ГруппаКолонок); 
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
				НовыйЭлемент.ПутьКДанным = "ДеревоНастроекОбъектов.ИсточникЗнач1"+ПриставкаУзла; 
				НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
				НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
				НовыйЭлемент = Элементы.Добавить("ИсточникЗнач3"+ПриставкаУзла, Тип("ПолеФормы"), ГруппаКолонок); 
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
				НовыйЭлемент.ПутьКДанным = "ДеревоНастроекОбъектов.ИсточникЗнач3"+ПриставкаУзла; 
				НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
				НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
				НовыйЭлемент = Элементы.Добавить("ИсточникЗнач2"+ПриставкаУзла, Тип("ПолеФормы"), ГруппаКолонок); 
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
				НовыйЭлемент.ПутьКДанным = "ДеревоНастроекОбъектов.ИсточникЗнач2"+ПриставкаУзла; 
				НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
				НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
				
				ЗначениеДеревоНастроекОбъектовРесторана = ДанныеФормыВЗначение(ДеревоНастроекОбъектов, Тип("ДеревоЗначений"));
				
			КонецЦикла;
			
			ВыборкаУзелОбмена.Сбросить()
			
		КонецЕсли;

		Пока ВыборкаУзелОбмена.Следующий() Цикл
			
			ВыборкаРодитель = ВыборкаУзелОбмена.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			ЭтотУзел = УзелОбмена = ВыборкаУзелОбмена.УзелОбмена;
			Если Не ПроцедурыОбменаДаннымиFrontOffice_Restoran.ЭтоЦентральнаяБаза(ВыборкаУзелОбмена.УзелОбмена) Тогда
				
				Если РестораныВОтдельныхТаблицах Тогда
					элДеревоРесторанаИмя = "ДеревоЗначенийЭтоЦБ_Ресторан"+ВыборкаУзелОбмена.УзелОбмена.Код;
					мНовыхРеквизитов = Новый Массив;
					НовыйРеквизитДляДанныхДерева = Новый РеквизитФормы(элДеревоРесторанаИмя, Новый ОписаниеТипов("ДеревоЗначений"));
					мНовыхРеквизитов.Добавить(НовыйРеквизитДляДанныхДерева);
					НоваяКолонкаИД = Новый РеквизитФормы("ИдентификаторОбъектаНастройки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных"),элДеревоРесторанаИмя, "ИД");
					НоваяКолонкаУзел = Новый РеквизитФормы("Узел", Новый ОписаниеТипов("ПланОбменаСсылка.ОбменДанными2K_CRS"),элДеревоРесторанаИмя);
					
					НоваяКолонкаАВТ = Новый РеквизитФормы("ИсточникЗнач1", Новый ОписаниеТипов("Булево"),элДеревоРесторанаИмя, "Авт");
					НоваяКолонкаЦБ = Новый РеквизитФормы("ИсточникЗнач3", Новый ОписаниеТипов("Булево"),элДеревоРесторанаИмя, "ЦБ");
					НоваяКолонкаБух = Новый РеквизитФормы("ИсточникЗнач2", Новый ОписаниеТипов("Булево"),элДеревоРесторанаИмя, "Бух");
					мНовыхРеквизитов.Добавить(НоваяКолонкаИД);
					мНовыхРеквизитов.Добавить(НоваяКолонкаУзел);
					мНовыхРеквизитов.Добавить(НоваяКолонкаАВТ);
					мНовыхРеквизитов.Добавить(НоваяКолонкаЦБ);
					мНовыхРеквизитов.Добавить(НоваяКолонкаБух);
					ЭтаФорма.ИзменитьРеквизиты(мНовыхРеквизитов);
					элДеревоРесторана = Элементы.Добавить(элДеревоРесторанаИмя, Тип("ТаблицаФормы"), Элементы.ГруппаРестораны);
					элДеревоРесторана.Отображение = ОтображениеТаблицы.Дерево;
					элДеревоРесторана.ИзменятьПорядокСтрок = Ложь;
					элДеревоРесторана.ИзменятьСоставСтрок = Ложь;
					элДеревоРесторана.ИзменятьПорядокСтрок = Ложь;        
					элДеревоРесторана.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;        
					элДеревоРесторана.Заголовок = "Узел "+ВыборкаУзелОбмена.УзелОбмена + " " + (ВыборкаУзелОбмена.УзелОбмена.Код);
					элДеревоРесторана.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
					элДеревоРесторана.ШрифтЗаголовка = Элементы.ДеревоЗначенийЭтоЦБ.ШрифтЗаголовка;
					элДеревоРесторана.ПутьКДанным = элДеревоРесторанаИмя;
					элДеревоРесторана.Ширина = 14;
					//ЗначениеДеревоНастроекОбъектовРесторана = ЧистКопия.Скопировать();
					//ЗначениеВДанныеФормы(ЗначениеДеревоНастроекОбъектовРесторана, Этаформа[НовыйРеквизитДляДанныхДерева.Имя]) 
					
					//НовыйЭлементГруппа = Элементы.Добавить("ГруппаЗнач_Ресторан"+ВыборкаУзелОбмена.УзелОбмена.Код, Тип("ГруппаКолонокФормы"), элДеревоРесторана); 
					НовыйЭлемент = Элементы.Добавить("ИдентификаторОбъектаНастройки_Ресторан"+ВыборкаУзелОбмена.УзелОбмена.Код,Тип("ПолеФормы"), элДеревоРесторана); 
					НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
					НовыйЭлемент.Видимость = Ложь;
					НовыйЭлемент.ПутьКДанным = элДеревоРесторанаИмя+".ИдентификаторОбъектаНастройки"; 
					НовыйЭлемент = Элементы.Добавить("Узел_Ресторан"+ВыборкаУзелОбмена.УзелОбмена.Код,Тип("ПолеФормы"), элДеревоРесторана); 
					НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
					НовыйЭлемент.Видимость = Ложь;
					НовыйЭлемент.ПутьКДанным = элДеревоРесторанаИмя+".Узел"; 
					
					НовыйЭлемент = Элементы.Добавить("ИсточникЗнач1_Ресторан"+ВыборкаУзелОбмена.УзелОбмена.Код,Тип("ПолеФормы"), элДеревоРесторана); 
					НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
					НовыйЭлемент.ПутьКДанным = элДеревоРесторанаИмя+".ИсточникЗнач1"; 
					НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
					НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
					НовыйЭлемент = Элементы.Добавить("ИсточникЗнач3_Ресторан"+ВыборкаУзелОбмена.УзелОбмена.Код,Тип("ПолеФормы"), элДеревоРесторана); 
					НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
					НовыйЭлемент.ПутьКДанным = элДеревоРесторанаИмя+".ИсточникЗнач3"; 
					НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
					НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
					НовыйЭлемент = Элементы.Добавить("ИсточникЗнач2_Ресторан"+ВыборкаУзелОбмена.УзелОбмена.Код,Тип("ПолеФормы"), элДеревоРесторана); 
					НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
					НовыйЭлемент.ПутьКДанным = элДеревоРесторанаИмя+".ИсточникЗнач2"; 
					НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
					НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
					ЗначениеДеревоНастроекОбъектовРесторана = ДанныеФормыВЗначение(Этаформа[НовыйРеквизитДляДанныхДерева.Имя], Тип("ДеревоЗначений"));
				КонецЕсли;
				
			Иначе
				
			КонецЕсли;                  
			
			Пока ВыборкаРодитель.Следующий() Цикл
				
				Если РестораныВОтдельныхТаблицах Тогда
					Если ПроцедурыОбменаДаннымиFrontOffice_Restoran.ЭтоЦентральнаяБаза(ВыборкаУзелОбмена.УзелОбмена) Тогда
						КоличествоСтрокОбъектов = КоличествоСтрокОбъектов + 1;
						НС_Родитель = ЗначениеДеревоНастроекОбъектов.Строки.Добавить();
						СоотвСтрокРодителей.Вставить(ВыборкаРодитель.Родитель, НС_Родитель);
					Иначе	
						НС_Родитель = ЗначениеДеревоНастроекОбъектовРесторана.Строки.Добавить();
					КонецЕсли;
					
					НС_Родитель.ИдентификаторОбъектаНастройки = ВыборкаРодитель.Родитель; 	
					НС_Родитель.Узел = ВыборкаУзелОбмена.УзелОбмена; 	
				КонецЕсли;
				
				Если Не РестораныВОтдельныхТаблицах Тогда
					
					НС_Родитель = СоотвСтрокРодителей.Получить(ВыборкаРодитель.Родитель);
					Если НС_Родитель = Неопределено Тогда
						КоличествоСтрокОбъектов = КоличествоСтрокОбъектов + 1;
						НС_Родитель = ЗначениеДеревоНастроекОбъектовРесторана.Строки.Добавить();
						НС_Родитель.ИдентификаторОбъектаНастройки = ВыборкаРодитель.Родитель; 	
						НС_Родитель.Узел = ВыборкаУзелОбмена.УзелОбмена; 	
						СоотвСтрокРодителей.Вставить(ВыборкаРодитель.Родитель, НС_Родитель);
					КонецЕсли;
					
				КонецЕсли;
				
				ВыборкаДетальныеЗаписи = ВыборкаРодитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если Не РестораныВОтдельныхТаблицах Тогда
						
						ПриставкаУзла = "_Ресторан"+ВыборкаУзелОбмена.УзелОбмена.Код;
				
						НС = СоотвСтрокРодителей.Получить(ВыборкаДетальныеЗаписи.Ссылка);
						Если НС = Неопределено Тогда
							НС = НС_Родитель.Строки.Добавить();
							НС.ИдентификаторОбъектаНастройки = ВыборкаДетальныеЗаписи.Ссылка;
							СоотвСтрокРодителей.Вставить(ВыборкаДетальныеЗаписи.Ссылка, НС);
						КонецЕсли;
						Если ПроцедурыОбменаДаннымиFrontOffice_Restoran.ЭтоЦентральнаяБаза(ВыборкаУзелОбмена.УзелОбмена) Тогда
							КоличествоСтрокОбъектов = КоличествоСтрокОбъектов + 1;
							НС.ИдентификаторОбъектаНастройки = ВыборкаДетальныеЗаписи.Ссылка;
							НС.Узел = ВыборкаУзелОбмена.УзелОбмена;
							Если ВыборкаДетальныеЗаписи.ИсточникДанных > 0 Тогда
								НС["ИсточникЗнач"+ВыборкаДетальныеЗаписи.ИсточникДанных] = Истина;	
							КонецЕсли; 	
						Иначе	
							НС["Узел"+ПриставкаУзла] = ВыборкаУзелОбмена.УзелОбмена;
							Если ВыборкаДетальныеЗаписи.ИсточникДанных > 0 Тогда
								НС["ИсточникЗнач"+ВыборкаДетальныеЗаписи.ИсточникДанных+ПриставкаУзла] = Истина;	
							КонецЕсли; 	
						КонецЕсли;
						Продолжить;
					КонецЕсли;
					
					Если ЭтотУзел Тогда
						КоличествоСтрокОбъектов = КоличествоСтрокОбъектов + 1;
					КонецЕсли;
					НС = НС_Родитель.Строки.Добавить();
					НС.ИдентификаторОбъектаНастройки = ВыборкаДетальныеЗаписи.Ссылка;
					НС.Узел = ВыборкаУзелОбмена.УзелОбмена;
					Если ВыборкаДетальныеЗаписи.ИсточникДанных > 0 Тогда
						НС["ИсточникЗнач"+ВыборкаДетальныеЗаписи.ИсточникДанных] = Истина;	
					КонецЕсли;
					
				КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
		ЗначениеВДанныеФормы(ЗначениеДеревоНастроекОбъектовРесторана, Этаформа.ДеревоНастроекОбъектов);
		//ЗначениеВДанныеФормы(ЗначениеДеревоНастроекОбъектов, ДеревоНастроекОбъектов);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗначенийИсточникЗнач4ПриИзменении(Элемент)
	а = Элемент
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыбратьСтраницуНастроекВСоответствииСРольюБазы()
КонецПроцедуры

&НаКлиенте
Процедура РолевоеЗначениеЭтогоУзлаПриИзменении(Элемент)
	ВыбратьСтраницуНастроекВСоответствииСРольюБазы()
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСтраницуНастроекВСоответствииСРольюБазы()

	Если РолевоеЗначениеЭтогоУзла = 3 Тогда
	    Элементы.СтраницыРолейЗначенияЭтогоУзла.ТекущаяСтраница= Элементы.ЭтаБазаЦентральная;
	ИначеЕсли РолевоеЗначениеЭтогоУзла = 2 Тогда
	    Элементы.СтраницыРолейЗначенияЭтогоУзла.ТекущаяСтраница= Элементы.ЭтаБазаПериферийная;
	Иначе	
	    Элементы.СтраницыРолейЗначенияЭтогоУзла.ТекущаяСтраница= Элементы.ЭтаБазаАвтономная;
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура ДеревоЗначенийЭтоЦБПриАктивизацииСтроки(Элемент)
	
	//ЭлРестораны = Элементы.ГруппаРестораны.ПодчиненныеЭлементы;
	//
	//НомерРесторана = 0;
	//
	//Для каждого ЭлРесторан Из ЭлРестораны Цикл
	//
	//	Если Не (ЭлРесторан.Видимость И ТипЗнч(ЭлРесторан) = Тип("ТаблицаФормы"))  Тогда
	//		Продолжить;
	//	КонецЕсли;	
	//	
	//	НомерРесторана = НомерРесторана + 1;
	//	
	//	ИдСтроки = Элементы.ДеревоЗначенийЭтоЦБ.ТекущаяСтрока + КоличествоСтрокОбъектов * НомерРесторана;

	//	ЭлРесторан.ТекущаяСтрока = ИдСтроки;
	//	
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗначенийЭтоЦБПередРазворачиванием(Элемент, Строка, Отказ)
	
	//Элементы.ДеревоЗначенийЭтоЦБ.ТекущаяСтрока = Строка;
	//
	//НомерРесторана = 0;
	//
	//ЭлРестораны = Элементы.ГруппаРестораны.ПодчиненныеЭлементы;
	//
	//Для каждого ЭлРесторан Из ЭлРестораны Цикл
	//
	//	Если Не (ЭлРесторан.Видимость И ТипЗнч(ЭлРесторан) = Тип("ТаблицаФормы"))  Тогда
	//		Продолжить;
	//	КонецЕсли;	
	//	
	//	НомерРесторана = НомерРесторана + 1;
	//	
	//	ИдСтроки = Строка + КоличествоСтрокОбъектов*НомерРесторана;
	//
	//	ЭлРесторан.ТекущаяСтрока = ИдСтроки;	
	//	ЭлРесторан.Развернуть(ИдСтроки);

	//КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоЗначенийЭтоЦБПередСворачиванием(Элемент, Строка, Отказ)
	
	//Элементы.ДеревоЗначенийЭтоЦБ.ТекущаяСтрока = Строка;
	//
	//НомерРесторана = 0;
	//
	//ЭлРестораны = Элементы.ГруппаРестораны.ПодчиненныеЭлементы;
	//
	//Для каждого ЭлРесторан Из ЭлРестораны Цикл
	//
	//	Если Не (ЭлРесторан.Видимость И ТипЗнч(ЭлРесторан) = Тип("ТаблицаФормы"))  Тогда
	//		Продолжить;
	//	КонецЕсли;	
	//	
	//	НомерРесторана = НомерРесторана + 1;
	//	
	//	ИдСтроки = Строка + КоличествоСтрокОбъектов*НомерРесторана;
	//
	//	ЭлРесторан.ТекущаяСтрока = ИдСтроки;	
	//	ЭлРесторан.Свернуть(ИдСтроки);

	//КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьПериферийнуюБазу(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
